app/controllers/products_controller.rb

  def index
    @products = Product.order('id ASC').limit(20)
---
SELECT  `products`.* FROM `products`  ORDER BY id DESC LIMIT 20

  def search
    # 検索フォームのキーワードをあいまい検索して、productsテーブルから20件の作品情報を取得する
    @products = Product.where('title LIKE(?)',"%#{params[:keyword]}%").limit(20)
---
SELECT  `products`.* FROM `products` WHERE (title: LIKE('%test%')) LIMIT 20