app/controllers/reviews_controller.rb

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`rate`, `review`, `product_id`, `nickname`, `created_at`, `updated_at`) VALUES (5, 'ttttt', 70, 'ererererererer', '2016-03-25 11:17:26', '2016-03-25 11:17:26')