app/controllers/users_controller.rb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 5
---
  def show
    @reviews = Review.where(user_id:current_user.id)