app/views/products/index.html.erb

                        <span class="rating-star">
                        <% if product.reviews.present? %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 62